verification/runs/F5_runs/re3900_corrected/case/system/fvSchemes
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}


ddtSchemes      { default Euler; }
gradSchemes     { default Gauss linear; }
laplacianSchemes { default Gauss linear corrected; }
snGradSchemes   { default corrected; }

divSchemes
{
    // Momentum second order; turbulence advection first-order upwind.
    // The A/B on the coarse grid: linearUpwind on k and omega left a
    // persistent leading-edge bounding oscillation (5997 bounding events,
    // residuals plateaued); upwind removed every bounding event and let the
    // run converge through residualControl. Turbulence advection is
    // negligible against production and destruction in this boundary layer,
    // and the measured observed order reports whatever the ladder delivers.
    // The "bounded" form is a steady-state device and is dropped for the
    // time-accurate runs.
    default                         none;
    div(phi,U)                      Gauss linearUpwind grad(U);
    div(phi,k)                      Gauss upwind;
    div(phi,omega)                  Gauss upwind;
    div((nuEff*dev2(T(grad(U)))))   Gauss linear;
}
interpolationSchemes { default linear; }
wallDist        { method meshWave; }
